
matrix = [
    [1, 2, 3, 4, 5, 6, 7, 8, 9],
    [10, 11, 12, 13, 14, 15, 16, 17, 18],
    [19, 20, 21, 22, 23, 24, 25, 26, 27],
    [28, 29, 30, 31, 32, 33, 34, 35, 36],
    [37, 38, 39, 40, 41, 42, 43, 44, 45],
    [46, 47, 48, 49, 50, 51, 52, 53, 54]
]

num_rows = len(matrix)  # определяем количество строк в матрице
num_cols = len(matrix[0])  # определяем количество столбцов в матрице

# итерируемся по столбцам только до половины, так как мы будем менять местами два столбца за одну итерацию
for col in range(num_cols // 2):
    opposite_col = num_cols - col - 1  # определяем индекс противоположного столбца
    for row in range(num_rows):
        # используем множественное присваивание, чтобы поменять местами элементы матрицы
        matrix[row][col], matrix[row][opposite_col] = matrix[row][opposite_col], matrix[row][col]

print(matrix)  # выводим новую матрицу в консоль